appimage.org
#+TITLE: AppImage Loom — Update, Integrate, and Maintain
#+DESCRIPTION: AppImage manifest, inventory, and release management
#+AUTHOR: Mètsàtron — Sovereign Weaver
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:text :comments no
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

#+BEGIN_SRC text :tangle all/.appimage/inventory/dead-overrides.ssv
# One filename per line (exact basename in ~/Applications). Comments allowed.
# Old emulators (citra/yuzu forks, WiiU tools) — replaced by successors:
citra.AppImage
citra-qt.AppImage
citra-room.AppImage
Linux-Yuzu-EA-4176.AppImage
TOTK Optimizer.AppImage
WiiUDownloader-Linux-x86_64.AppImage
yuzu-mainline-20240301-6879db182.AppImage
# balenaEtcher dropped AppImage support (GitHub v2.1.4+ has no AppImage):
balenaEtcher-2.1.3-x64.AppImage
# Repos DMCA'd or otherwise defunct:
# eden-emulator-releases  (GitHub DMCA'd March 2026 — use Eden Forgejo conf)
# suzy, sudachi, nuzu     (yuzu forks, DMCA'd)
#+END_SRC

* AppImage inventory (auto-updated)
#+name: appimage-inventory-all
#+BEGIN_SRC text :tangle no
FILE NAME HAS_UPDATE_INFO UPDATE_KIND NOTE MANAGED_BY
#+END_SRC

#+name: appimage-inventory-supports
#+BEGIN_SRC text :tangle no
FILE NAME HAS_UPDATE_INFO UPDATE_KIND NOTE MANAGED_BY
appimaged-911-x86_64.AppImage appimaged-911-x86_64 yes ZSync via GitHub Releases ok zsync
appimetool-911-x86_64.AppImage appimetool-911-x86_64 yes ZSync via GitHub Releases ok zsync
appimageupdatetool-x86_64.AppImage appimageupdatetool-x86_64 yes ZSync via GitHub Releases ok zsync
AppImageUpdate-x86_64.AppImage AppImageUpdate-x86_64 yes ZSync via GitHub Releases ok zsync
mkappimage-911-x86_64.AppImage mkappimage-911-x86_64 yes ZSync via GitHub Releases ok zsync
validate-x86_64.AppImage validate-x86_64 yes ZSync via GitHub Releases ok zsync
eden-linux-v0.2.0-rc2-amd64.AppImage eden-linux-v0.2.0-rc2-amd64 no conf:conf-available conf:eden
azahar.AppImage azahar no conf:conf-available conf:azahar
claude-desktop-1.1.5749-1.3.17-amd64.AppImage claude-desktop-1.1.5749-1.3.17-amd64 no conf:conf-available conf:claude-desktop
claude-devtools-0.4.9.AppImage claude-devtools-0.4.9 no conf:conf-available conf:claude-devtools
cursor-2.6.20-x86_64.AppImage cursor-2.6.20-x86_64 no conf:conf-available conf:cursor
opencode-electron-linux-x86_64.AppImage opencode-electron-linux-x86_64 no conf:conf-available conf:opencode
#+END_SRC

#+name: appimage-inventory-manual
#+BEGIN_SRC text :tangle no
FILE NAME HAS_UPDATE_INFO UPDATE_KIND NOTE MANAGED_BY
balenaEtcher-2.1.3-x64.AppImage balenaEtcher-2.1.3-x64 no no-github-appimage dead
cool-retro-term-1.1.1-x86_64.AppImage cool-retro-term-1.1.1-x86_64 no no-github-appimage unmanaged
edex-ui-linux-x86_64.AppImage edex-ui-linux-x86_64 no no-github-appimage unmanaged
goxel-0.15.1.AppImage goxel-0.15.1 no no-github-appimage unmanaged
appimagepool-5.1.0-x86_64.AppImage appimagepool-5.1.0-x86_64 no no-github-appimage unmanaged
#+END_SRC

#+name: appimage-inventory-dead
#+BEGIN_SRC text :tangle no
FILE NAME HAS_UPDATE_INFO UPDATE_KIND NOTE MANAGED_BY
citra.AppImage citra no dead dead
citra-qt.AppImage citra-qt no dead dead
citra-room.AppImage citra-room no dead dead
linux-yuzu-ea-4176.AppImage linux-yuzu-ea-4176 no dead dead
totk-optimizer.AppImage totk-optimizer no dead dead
wiiudownloader-linux-x86_64.AppImage wiiudownloader-linux-x86_64 no dead dead
yuzu-mainline-20240301-6879db182.AppImage yuzu-mainline-20240301-6879db182 no dead dead
eden-emulator-releases.AppImage eden-emulator-releases no dead dead
balenaEtcher-2.1.3-x64.AppImage balenaEtcher-2.1.3-x64 no dead dead
#+END_SRC

* Purpose
Manage AppImages under =~/Applications=: daemon integration, cross-init
scheduling, conf-driven release updates (hybrid ZSync + per-repo polling),
and cleaning of broken desktop entries.

** Update strategy (hybrid, two-pass)
- *Pass 1 — ZSync:* appimageupdatetool -r for AppImages with embedded update info
- *Pass 2 — Conf:* apprelease update-all for conf-managed AppImages (GitHub, GitLab,
  Codeberg, Forgejo, direct URL)
- *Pass 3 — Cleanup:* remove .zs-old stale versions, scrub broken .desktop entries

** Conf-managed apps
Each conf file in =all/.config/apprelease.d/= declares:
: NAME, FORGE, REPO, TYPE=appimage, APPIMG_NAME, ASSET_RE, [FORGE_BASE_URL], [DIRECT_URL], [DIRECT_VERSION_CMD]

* Directory conventions
- AppImages live in: =~/Applications=
- User binaries/scripts: =~/.local/bin=
- User services: =~/.config/systemd/user= (systemd) or =~/.config/appimaged/= (sysv-init)
- User desktop cache: =~/.local/share/applications=
- Conf dir: =~/.config/apprelease.d/= (stowed from =all/.config/apprelease.d/=)
- Cache: =~/.cache/apprelease/=

* Requirements (packages/tools)
- =desktop-file-utils= (for =desktop-file-validate=)
- =glib2.0-bin= (for =gio=) — optional; falls back to rm if missing
- =jq= (for JSON parsing in apprelease)
- For daemon integration: systemd user session (X230) or =~/.config/appimaged/= daemon (T480s)

* Per-app release conf files
#+name: appimage-conf-eden
#+BEGIN_SRC text :tangle all/.config/apprelease.d/eden.conf :tangle-mode (identity #o644)
NAME="Eden"
FORGE="forgejo"
FORGE_BASE_URL="https://git.eden-emu.dev"
REPO="eden-emu/eden"
TYPE="appimage"
APPIMG_NAME="Eden"
ASSET_RE='Eden-Linux-v.*-amd64-clang-pgo\.AppImage$'
# GitHub DMCA'd in March 2026; canonical Forgejo at git.eden-emu.dev
# Nightly builds: https://git.eden-emu.dev/eden-ci/nightly (separate repo, /tags not /releases)
#+END_SRC

#+name: appimage-conf-azahar
#+BEGIN_SRC text :tangle all/.config/apprelease.d/azahar.conf :tangle-mode (identity #o644)
NAME="Azahar"
FORGE="github"
REPO="azahar-emu/azahar"
TYPE="appimage"
APPIMG_NAME="Azahar"
ASSET_RE='azahar\.AppImage$'
# citra/lime3ds successor; Flatpak also available on Flathub
# AzaharPlus fork: https://github.com/AzaharPlus/AzaharPlus
#+END_SRC

#+name: appimage-conf-claude-desktop
#+BEGIN_SRC text :tangle all/.config/apprelease.d/claude-desktop.conf :tangle-mode (identity #o644)
NAME="Claude Desktop"
FORGE="github"
REPO="aaddrick/claude-desktop-debian"
TYPE="appimage"
APPIMG_NAME="claude-desktop"
ASSET_RE='claude-desktop-.*-amd64\.AppImage$'
# Community-built AppImage; has zsync in release assets
# Asset: claude-desktop-<version>-<build>-amd64.AppImage + .zsync
#+END_SRC

#+name: appimage-conf-claude-devtools
#+BEGIN_SRC text :tangle all/.config/apprelease.d/claude-devtools.conf :tangle-mode (identity #o644)
NAME="Claude DevTools"
FORGE="github"
REPO="matt1398/claude-devtools"
TYPE="appimage"
APPIMG_NAME="claude-devtools"
ASSET_RE='claude-devtools-.*\.AppImage$'
# Latest: v0.4.10 — https://github.com/matt1398/claude-devtools/releases/tag/v0.4.10
#+END_SRC

#+name: appimage-conf-cursor
#+BEGIN_SRC text :tangle all/.config/apprelease.d/cursor.conf :tangle-mode (identity #o644)
NAME="Cursor"
FORGE="direct"
APPIMG_NAME="Cursor"
# Cursors updater is flaky; use downloader.cursor.sh directly
# Version extracted from the downloaded file's --version or filename
DIRECT_URL="https://downloader.cursor.sh/linux/appImage/x64"
DIRECT_VERSION_CMD='curl -sL "%s" -o /dev/null -w "%{url_effective}" 2>/dev/null | grep -oE "[0-9]+\.[0-9]+\.[0-9]+" | head -n1'
# The downloader.cursor.sh URL always returns the latest; we detect version
# from the cached file name after download, comparing against installed.
# Strategy: download to cache with a temp name, compare with installed version
# (parsed from installed filename), install if different, then create -latest symlink.
# For version detection, run: ./Cursor-*.AppImage --version 2>/dev/null | head -1
# Asset name in cache will be inferred from Content-Disposition header or URL
#+END_SRC

#+name: appimage-conf-opencode
#+BEGIN_SRC text :tangle all/.config/apprelease.d/opencode.conf :tangle-mode (identity #o644)
NAME="OpenCode"
FORGE="github"
REPO="anomalyco/opencode"
TYPE="appimage"
APPIMG_NAME="opencode-electron"
ASSET_RE='opencode-electron-linux-x86_64\.AppImage$'
# anomalyco/opencode is the working mirror; sst/opencode is private/defunct
# Alternative with broader libc compatibility (musl/older glibc):
# REPO="pkgforge-dev/opencode-AppImage-Enhanced"
# ASSET_RE='OpenCode-v.*-anylinux-x86_64\.AppImage$'
# pkgforge builds are by @Samueru-sama and target portable compatibility
#+END_SRC

#+name: appimage-conf-cool-retro-term
#+BEGIN_SRC text :tangle all/.config/apprelease.d/cool-retro-term.conf :tangle-mode (identity #o644)
NAME="Cool-Retro-Term"
FORGE="github"
REPO="Swordfish90/cool-retro-term"
TYPE="appimage"
APPIMG_NAME="cool-retro-term"
ASSET_RE='cool-retro-term-.*\.AppImage$'
# Confirmed asset: cool-retro-term-2.0.0-beta1.AppImage (v2.0.0-beta1)
# Note: lowercase filename in GitHub releases, not Cool-Retro-Term
# v1.1.1 was the old invalid-pattern; v2.0.0-beta1 is the current release
#+END_SRC

#+name: appimage-conf-goxel
#+BEGIN_SRC text :tangle all/.config/apprelease.d/goxel.conf :tangle-mode (identity #o644)
NAME="Goxel"
FORGE="github"
REPO="guillaumechereau/goxel"
TYPE="appimage"
APPIMG_NAME="goxel"
ASSET_RE='goxel-.*\.AppImage$'
# Confirmed: goxel-0.15.1.AppImage from v0.15.1 (2024-07-28)
# Note: correct repo is guillaumechereau/goxel (NOT guanxiao/goxel)
#+END_SRC

#+name: appimage-conf-appimagepool
#+BEGIN_SRC text :tangle all/.config/apprelease.d/appimagepool.conf :tangle-mode (identity #o644)
NAME="AppImagePool"
FORGE="github"
REPO="prateekmedia/appimagepool"
TYPE="appimage"
APPIMG_NAME="appimagepool"
ASSET_RE='appimagepool-.*-x86_64\.AppImage$'
# ivan-hc repo was renamed/removed; prateekmedia is the current upstream
# Confirmed: appimagepool-5.1.0-x86_64.AppImage from v5.1.0
#+END_SRC

#+name: appimage-conf-balena-etcher
#+BEGIN_SRC text :tangle all/.config/apprelease.d/balena-etcher.conf :tangle-mode (identity #o644)
NAME="balenaEtcher"
FORGE="dead"
APPIMG_NAME="balenaEtcher"
NOTE="balena dropped AppImage support; GitHub releases v2.1.4+ have no AppImage"
# balenaEtcher-2.1.3-x64.AppImage is the last AppImage version
# Current releases (v2.1.4+) only have .deb, .rpm, .dmg, .exe, .zip
# balena's own download server no longer hosts AppImages
# If you need a newer version, use the .deb or Flatpak instead.
# Move to dead-overrides once the installed AppImage is removed.
#+END_SRC

