appimage.org
* appimaged — cross-init integrator daemon
** Set up =appimaged= (cross-init: systemd user service or sysv-init daemon)
On systemd (X230): creates =~/.config/systemd/user/appimaged.service=
On sysv-init (T480s): creates =~/.config/appimaged/appimaged.conf= and uses daemonize

#+BEGIN_SRC bash :tangle all/.local/bin/appimage-integrator-setup :shebang "#!/usr/bin/env bash"
set -Eeuo pipefail
APPS_DIR="${APPS_DIR:-$HOME/Applications}"
BIN="$HOME/.local/bin/appimaged"
DAEMON_DIR="$HOME/.config/appimaged"
SYSTEMD_USER_DIR="$HOME/.config/systemd/user"

cand="$(ls -t "$APPS_DIR"/appimaged-*-x86_64.AppImage 2>/dev/null | head -n1 || true)"
if [[ -z "$cand" ]]; then
    echo "!! No appimaged-*-x86_64.AppImage in $APPS_DIR"; exit 1
fi
install -Dm755 "$cand" "$BIN"

init_system() {
    if [[ -d /run/systemd/system ]]; then echo "systemd"; return 0; fi
    if [[ -d /run/openrc ]]; then echo "openrc"; return 0; fi
    if [[ -f /proc/1/comm ]] && grep -q 'init' /proc/1/comm 2>/dev/null; then
        if [[ -x /sbin/daemonize ]] || command -v daemonize >/dev/null 2>&1; then
            echo "sysv"; return 0
        fi
        echo "sysv"; return 0
    fi
    echo "unknown"; return 1
}

INIT="$(init_system)"
echo "== appimage-integrator-setup =="
echo "init system detected: $INIT"

case "$INIT" in
    systemd)
        echo "Setting up systemd user service..."
        mkdir -p "$SYSTEMD_USER_DIR"
        cat > "$SYSTEMD_USER_DIR/appimaged.service" <<EOF
[Unit]
Description=appimaged (AppImage integration daemon)
After=graphical-session.target

[Service]
ExecStart=%h/.local/bin/appimaged -v -q
Restart=on-failure
RestartSec=2
Environment=PATH=%h/.local/bin:/usr/local/bin:/usr/bin

[Install]
WantedBy=default.target
EOF
        systemctl --user daemon-reload 2>/dev/null || true
        systemctl --user enable --now appimaged.service 2>/dev/null || true
        sleep 1
        systemctl --user status appimaged --no-pager || true
        ;;
    sysv)
        echo "Setting up sysv-init daemon..."
        mkdir -p "$DAEMON_DIR"
        cat > "$DAEMON_DIR/appimaged.conf" <<EOF
#!/bin/sh
NAME=appimaged
DESC="AppImage integration daemon"
DAEMON=$BIN
PIDFILE=$HOME/.config/appimaged/appimaged.pid
EOF
        if command -v daemonize >/dev/null 2>&1; then
            cat > "$HOME/.config/appimaged/appimaged-start" <<EOF
#!/bin/sh
# Start appimaged as a background daemon using daemonize
daemonize -p "$HOME/.config/appimaged/appimaged.pid" -l "$HOME/.config/appimaged/appimaged.lck" "$BIN" -v -q
EOF
            chmod +x "$HOME/.config/appimaged/appimaged-start"
            # Launch now
            "$HOME/.config/appimaged/appimaged-start"
            echo "appimaged started via daemonize (pid: $(cat "$HOME/.config/appimaged/appimaged.pid" 2>/dev/null || echo 'unknown'))"
        else
            # No daemonize — use nohup/setsid from ~/.xprofile instead
            cat > "$HOME/.config/appimaged/appimaged-launch" <<EOF
#!/bin/sh
# Launch appimaged in background (for ~/.xprofile or manual launch)
# No daemonize available; use setsid as fallback
setsid "$BIN" -v -q </dev/null >"$HOME/.config/appimaged/appimaged.log" 2>&1 &
echo "appimaged launched in background (pid: $!)"
EOF
            chmod +x "$HOME/.config/appimaged/appimaged-launch"
            # Also add to autostart dir if it exists
            mkdir -p "$HOME/.config/autostart"
            cat > "$HOME/.config/autostart/appimaged.desktop" <<EOF
[Desktop Entry]
Type=Application
Name=appimaged
Exec=$HOME/.config/appimaged/appimaged-launch
X-GNOME-Autostart=true
EOF
            echo "No daemonize — created appimaged-launch script and autostart .desktop"
            echo "Run: ~/.config/appimaged/appimaged-launch  # to start now"
        fi
        ;;
    *)
        echo "!! Unknown init system: $INIT — cannot configure daemon"
        echo "  Manual start: $BIN -v -q &"
        ;;
esac

echo "== done =="
#+END_SRC

** Health check: cross-init aware
#+BEGIN_SRC bash :tangle all/.local/bin/appimage-health :shebang "#!/usr/bin/env bash"
set -Eeuo pipefail
echo "== Integrator processes =="
pgrep -af appimaged || echo "(none)"
pgrep -af appimagelauncher || echo "(no AIL)"

init_system() {
    if [[ -d /run/systemd/system ]]; then echo "systemd"; return 0; fi
    if [[ -f /proc/1/comm ]] && grep -q 'init' /proc/1/comm 2>/dev/null; then echo "sysv"; return 0; fi
    echo "unknown"; return 1
}

INIT="$(init_system)"
echo "== init system: $INIT =="

case "$INIT" in
    systemd)
        echo "== appimaged (systemd) =="
        systemctl --user status appimaged --no-pager 2>/dev/null || echo "(not running via systemd)"
        echo "== recent logs =="
        journalctl --user -u appimaged -n 30 --no-pager 2>/dev/null || true
        ;;
    sysv)
        echo "== appimaged (sysv-init) =="
        if [[ -f "$HOME/.config/appimaged/appimaged.pid" ]]; then
            pid="$(cat "$HOME/.config/appimaged/appimaged.pid" 2>/dev/null)"
            if [[ -n "$pid" ]] && kill -0 "$pid" 2>/dev/null; then
                echo "running (pid $pid)"
            else
                echo "pid file exists but process not running"
            fi
        else
            echo "(no pid file — may not be running)"
        fi
        [[ -f "$HOME/.config/appimaged/appimaged.log" ]] && echo "== log (last 30 lines) ==" && tail -n30 "$HOME/.config/appimaged/appimaged.log" || true
        ;;
    *)
        echo "(unknown init system — can't check daemon status)"
        ;;
esac

echo "== conf-managed apprelease health =="
for conf in "$HOME/.config/apprelease.d"/*.conf "$HOME/DotCortex/all/.config/apprelease.d"/*.conf 2>/dev/null; do
    [[ -f "$conf" ]] || continue
    app="$(basename "$conf" .conf)"
    ~/.local/bin/apprelease health "$app" 2>/dev/null || true
done
#+END_SRC

* Bulk update of all AppImages (hybrid two-pass)

Pass 1: ZSync via appimageupdatetool
Pass 2: Conf via apprelease
Pass 3: Cleanup + desktop scrub

#+BEGIN_SRC bash :tangle all/.local/bin/appimage-update-all :shebang "#!/usr/bin/env bash"
set -Eeuo pipefail

APPS_DIR="${APPS_DIR:-$HOME/Applications}"
LOG="${LOG:-$HOME/appimage-update.log}"
TOOL="$APPS_DIR/appimageupdatetool-x86_64.AppImage"
SELF_UPDATE="${SELF_UPDATE:-1}"
CONF_DIR="$HOME/.config/apprelease.d"
REPO_CONF_DIR="$HOME/DotCortex/all/.config/apprelease.d"
DEAD_OVER="$HOME/DotCortex/all/.appimage/inventory/dead-overrides.ssv"

ts() { date +"%Y-%m-%d %H:%M:%S"; }

is_symlink() { [[ -L "$1" ]]; }

is_conf_managed() {
    local base="$1" name app dir f appimg_name
    name="${base%.AppImage}"
    for dir in "$CONF_DIR" "$REPO_CONF_DIR"; do
        [[ -d "$dir" ]] || continue
        for f in "$dir"/*.conf; do
            [[ -f "$f" ]] || continue
            appimg_name="$(awk -F= '/^APPIMG_NAME=/{gsub(/"/,"",$2); print $2; exit}' "$f")"
            if [[ -n "$appimg_name" && "$name" == "${appimg_name}"* ]]; then return 0; fi
        done
    done
    return 1
}

is_dead() {
    local base="$1"
    [[ -f "$DEAD_OVER" ]] || return 1
    grep -qiF "$base" "$DEAD_OVER"
}

echo "== appimage-update-all @ $(ts) ==" | tee -a "$LOG"
echo "PASS 1: ZSync" | tee -a "$LOG"

if [[ "$SELF_UPDATE" = "1" && -x "$TOOL" ]]; then
    echo "-- self-updating appimageupdatetool..." | tee -a "$LOG"
    if "$TOOL" --self-update >>"$LOG" 2>&1; then
        echo "ok: self-update" | tee -a "$LOG"
    else
        echo "warn: self-update failed (continuing)" | tee -a "$LOG"
    fi
fi

shopt -s nullglob
{
    for path in "$APPS_DIR"/*.AppImage; do
        base="$(basename -- "$path")"

        if is_symlink "$path"; then
            continue
        fi

        case "$base" in
            appimageupdatetool-*.AppImage|AppImageUpdate-*.AppImage)
                echo "skip: $base (self-update tool)" | tee -a "$LOG"; continue ;;
        esac

        if is_dead "$base"; then
            echo "skip: $base (dead)" | tee -a "$LOG"; continue
        fi

        if is_conf_managed "$base"; then
            echo "skip: $base (conf-managed, Pass 2)" | tee -a "$LOG"; continue
        fi

        echo "==> $base" | tee -a "$LOG"

        if [[ ! -x "$TOOL" ]]; then
            echo "fail: no appimageupdatetool at $TOOL" | tee -a "$LOG"
            continue
        fi

        set +e
        "$TOOL" -r "$path" >>"$LOG" 2>&1
        rc=$?
        set -e

        if [[ $rc -eq 0 ]]; then
            echo "ok: $base" | tee -a "$LOG"
        else
            echo "fail: $base (exit $rc). continuing." | tee -a "$LOG"
        fi
    done
} 2>>"$LOG"
shopt -u nullglob

echo "" | tee -a "$LOG"
echo "PASS 2: Conf-managed via apprelease" | tee -a "$LOG"
APRELEASE="$HOME/.local/bin/apprelease"
if [[ -x "$APRELEASE" ]]; then
    if "$APRELEASE" update-all 2>&1 | tee -a "$LOG"; then
        echo "ok: conf pass" | tee -a "$LOG"
    else
        echo "warn: conf pass completed with errors" | tee -a "$LOG"
    fi
else
    echo "skip: apprelease not found" | tee -a "$LOG"
fi

# Refresh the appimaged wrapper (idempotent)
if [[ -d /run/systemd/system ]]; then
    if systemctl --user is-enabled --quiet appimaged.service 2>/dev/null; then
        ln -sf "$APPS_DIR"/appimaged-*-x86_64.AppImage "$HOME/.local/bin/appimaged" 2>/dev/null || true
        chmod +x "$HOME/.local/bin/appimaged" 2>/dev/null || true
        echo "-- appimaged wrapper refreshed" | tee -a "$LOG"
    fi
fi

echo "" | tee -a "$LOG"
echo "PASS 3: Cleanup" | tee -a "$LOG"

# Remove stale .zs-old files
zs_old_count=0
for f in "$APPS_DIR"/*.zs-old; do
    rm -f "$f" && ((zs_old_count++)) || true
done
echo "cleanup: removed $zs_old_count .zs-old files" | tee -a "$LOG"

# Make sure everything we touch is executable
chmod -f +x "$APPS_DIR"/*.AppImage 2>/dev/null || true
chmod -f +x "$HOME/.local/share/applications/"*.desktop 2>/dev/null || true

# Scrub broken .desktop entries (integrated)
APPS="$APPS_DIR" ~/.local/bin/appimage-scrub-desktops 2>&1 | tee -a "$LOG"

echo "== done @ $(ts) ==" | tee -a "$LOG"
#+END_SRC

