all/.local/bin/appimage-health
#!/usr/bin/env bash
# Health check: cross-init aware

# [[file:../../../appimage.org::*Health check: cross-init aware][Health check: cross-init aware:1]]
set -Eeuo pipefail
echo "== Integrator processes =="
pgrep -af appimaged || echo "(none)"
pgrep -af appimagelauncher || echo "(no AIL)"

init_system() {
    if [[ -d /run/systemd/system ]]; then echo "systemd"; return 0; fi
    if [[ -f /proc/1/comm ]] && grep -q 'init' /proc/1/comm 2>/dev/null; then echo "sysv"; return 0; fi
    echo "unknown"; return 1
}

INIT="$(init_system)"
echo "== init system: $INIT =="

case "$INIT" in
    systemd)
        echo "== appimaged (systemd) =="
        systemctl --user status appimaged --no-pager 2>/dev/null || echo "(not running via systemd)"
        echo "== recent logs =="
        journalctl --user -u appimaged -n 30 --no-pager 2>/dev/null || true
        ;;
    sysv)
        echo "== appimaged (sysv-init) =="
        if [[ -f "$HOME/.config/appimaged/appimaged.pid" ]]; then
            pid="$(cat "$HOME/.config/appimaged/appimaged.pid" 2>/dev/null)"
            if [[ -n "$pid" ]] && kill -0 "$pid" 2>/dev/null; then
                echo "running (pid $pid)"
            else
                echo "pid file exists but process not running"
            fi
        else
            echo "(no pid file — may not be running)"
        fi
        [[ -f "$HOME/.config/appimaged/appimaged.log" ]] && echo "== log (last 30 lines) ==" && tail -n30 "$HOME/.config/appimaged/appimaged.log" || true
        ;;
    *)
        echo "(unknown init system — can't check daemon status)"
        ;;
esac

echo "== conf-managed apprelease health =="
for conf in "$HOME/.config/apprelease.d"/*.conf "$HOME/DotCortex/all/.config/apprelease.d"/*.conf 2>/dev/null; do
    [[ -f "$conf" ]] || continue
    app="$(basename "$conf" .conf)"
    ~/.local/bin/apprelease health "$app" 2>/dev/null || true
done
# Health check: cross-init aware:1 ends here
