all/.local/bin/appimage-integrator-setup
#!/usr/bin/env bash
# Set up =appimaged= (cross-init: systemd user service or sysv-init daemon)
# On systemd (X230): creates =~/.config/systemd/user/appimaged.service=
# On sysv-init (T480s): creates =~/.config/appimaged/appimaged.conf= and uses daemonize


# [[file:../../../appimage.org::*Set up =appimaged= (cross-init: systemd user service or sysv-init daemon)][Set up =appimaged= (cross-init: systemd user service or sysv-init daemon):1]]
set -Eeuo pipefail
APPS_DIR="${APPS_DIR:-$HOME/Applications}"
BIN="$HOME/.local/bin/appimaged"
DAEMON_DIR="$HOME/.config/appimaged"
SYSTEMD_USER_DIR="$HOME/.config/systemd/user"

cand="$(ls -t "$APPS_DIR"/appimaged-*-x86_64.AppImage 2>/dev/null | head -n1 || true)"
if [[ -z "$cand" ]]; then
    echo "!! No appimaged-*-x86_64.AppImage in $APPS_DIR"; exit 1
fi
install -Dm755 "$cand" "$BIN"

init_system() {
    if [[ -d /run/systemd/system ]]; then echo "systemd"; return 0; fi
    if [[ -d /run/openrc ]]; then echo "openrc"; return 0; fi
    if [[ -f /proc/1/comm ]] && grep -q 'init' /proc/1/comm 2>/dev/null; then
        if [[ -x /sbin/daemonize ]] || command -v daemonize >/dev/null 2>&1; then
            echo "sysv"; return 0
        fi
        echo "sysv"; return 0
    fi
    echo "unknown"; return 1
}

INIT="$(init_system)"
echo "== appimage-integrator-setup =="
echo "init system detected: $INIT"

case "$INIT" in
    systemd)
        echo "Setting up systemd user service..."
        mkdir -p "$SYSTEMD_USER_DIR"
        cat > "$SYSTEMD_USER_DIR/appimaged.service" <<EOF
[Unit]
Description=appimaged (AppImage integration daemon)
After=graphical-session.target

[Service]
ExecStart=%h/.local/bin/appimaged -v -q
Restart=on-failure
RestartSec=2
Environment=PATH=%h/.local/bin:/usr/local/bin:/usr/bin

[Install]
WantedBy=default.target
EOF
        systemctl --user daemon-reload 2>/dev/null || true
        systemctl --user enable --now appimaged.service 2>/dev/null || true
        sleep 1
        systemctl --user status appimaged --no-pager || true
        ;;
    sysv)
        echo "Setting up sysv-init daemon..."
        mkdir -p "$DAEMON_DIR"
        cat > "$DAEMON_DIR/appimaged.conf" <<EOF
#!/bin/sh
NAME=appimaged
DESC="AppImage integration daemon"
DAEMON=$BIN
PIDFILE=$HOME/.config/appimaged/appimaged.pid
EOF
        if command -v daemonize >/dev/null 2>&1; then
            cat > "$HOME/.config/appimaged/appimaged-start" <<EOF
#!/bin/sh
# Start appimaged as a background daemon using daemonize
daemonize -p "$HOME/.config/appimaged/appimaged.pid" -l "$HOME/.config/appimaged/appimaged.lck" "$BIN" -v -q
EOF
            chmod +x "$HOME/.config/appimaged/appimaged-start"
            # Launch now
            "$HOME/.config/appimaged/appimaged-start"
            echo "appimaged started via daemonize (pid: $(cat "$HOME/.config/appimaged/appimaged.pid" 2>/dev/null || echo 'unknown'))"
        else
            # No daemonize — use nohup/setsid from ~/.xprofile instead
            cat > "$HOME/.config/appimaged/appimaged-launch" <<EOF
#!/bin/sh
# Launch appimaged in background (for ~/.xprofile or manual launch)
# No daemonize available; use setsid as fallback
setsid "$BIN" -v -q </dev/null >"$HOME/.config/appimaged/appimaged.log" 2>&1 &
echo "appimaged launched in background (pid: $!)"
EOF
            chmod +x "$HOME/.config/appimaged/appimaged-launch"
            # Also add to autostart dir if it exists
            mkdir -p "$HOME/.config/autostart"
            cat > "$HOME/.config/autostart/appimaged.desktop" <<EOF
[Desktop Entry]
Type=Application
Name=appimaged
Exec=$HOME/.config/appimaged/appimaged-launch
X-GNOME-Autostart=true
EOF
            echo "No daemonize — created appimaged-launch script and autostart .desktop"
            echo "Run: ~/.config/appimaged/appimaged-launch  # to start now"
        fi
        ;;
    *)
        echo "!! Unknown init system: $INIT — cannot configure daemon"
        echo "  Manual start: $BIN -v -q &"
        ;;
esac

echo "== done =="
# Set up =appimaged= (cross-init: systemd user service or sysv-init daemon):1 ends here
