appimage.org
** Stop & scrub AppImageLauncher artifacts (user + system)
#+BEGIN_SRC bash :tangle all/.local/bin/appimage-ail-scrub :shebang "#!/usr/bin/env bash"
set -Eeuo pipefail
echo "== AIL scrub (user + system) =="

if [[ -d /run/systemd/system ]]; then
    systemctl --user disable --now appimagelauncherd.service 2>/dev/null || true
    systemctl --global disable appimagelauncherd.service 2>/dev/null || true
    sudo systemctl --global disable appimagelauncherd.service 2>/dev/null || true
fi

rm -f ~/.config/systemd/user/appimagelauncherd.service 2>/dev/null || true
sudo rm -f /etc/systemd/user/appimagelauncherd.service /usr/lib/systemd/user/appimagelauncherd.service 2>/dev/null || true
sudo rm -f /etc/systemd/user/default.target.wants/appimagelauncherd.service /usr/lib/systemd/user/default.target.wants/appimagelauncherd.service 2>/dev/null || true

sed -i '/application\/x-appimage/d' ~/.config/mimeapps.list 2>/dev/null || true
sed -i '/application\/x-appimage/d' ~/.local/share/applications/mimeapps.list 2>/dev/null || true
sudo update-desktop-database /usr/share/applications 2>/dev/null || true
sudo update-mime-database /usr/share/mime 2>/dev/null || true

sudo rm -f /etc/apt/sources.list.d/appimagelauncher-team-*.list /etc/apt/trusted.gpg.d/appimagelauncher-team-*.gpg* 2>/dev/null || true

if [[ -d /run/systemd/system ]]; then
    systemctl --user daemon-reload 2>/dev/null || true
    systemctl --user daemon-reexec 2>/dev/null || true
fi

echo "== done =="
#+END_SRC

* Makefile glue (appimage.mk)
#+BEGIN_SRC makefile :tangle all/.mk/appimage.mk
# ~/DotCortex/all/.mk/appimage.mk
.RECIPEPREFIX := |
SHELL := /bin/bash

APPS_DIR := $(HOME)/Applications
BIN_DIR := $(HOME)/.local/bin

INTEGRATE  := $(BIN_DIR)/appimage-integrator-setup
AIL_SCRUB  := $(BIN_DIR)/appimage-ail-scrub
HEALTH     := $(BIN_DIR)/appimage-health
UPDATE_ALL := $(BIN_DIR)/appimage-update-all
SCRUB_DESK := $(BIN_DIR)/appimage-scrub-desktops
INVENTORY  := $(BIN_DIR)/appimage-inventory
APRELEASE  := $(BIN_DIR)/apprelease

.PHONY: appimage-integrate appimage-ail-scrub appimage-health \
        appimage-update appimage-update-all appimage-scrub-desktops \
        appimage-inventory appimage-aprelease-list appimage-aprelease-update \
        appimage-aprelease-update-all

appimage-integrate: $(INTEGRATE)
| $(INTEGRATE)

appimage-ail-scrub: $(AIL_SCRUB)
| $(AIL_SCRUB)

appimage-health: $(HEALTH)
| $(HEALTH)

appimage-update: $(UPDATE_ALL)
| env SELF_UPDATE=1 $(UPDATE_ALL)

appimage-update-all: appimage-update

appimage-scrub-desktops: $(SCRUB_DESK)
| $(SCRUB_DESK)

appimage-inventory: $(INVENTORY)
| $(INVENTORY)

# apprelease verbs
appimage-aprelease-list: $(APRELEASE)
| $(APRELEASE) list

appimage-aprelease-update: $(APRELEASE)
| $(APRELEASE) update$(if $(filter 1,$(words $(filter-out $@,$(MAKECMDGOALS)))), $(word 2,$(filter-out $@,$(MAKECMDGOALS)))),)

appimage-aprelease-update-all: $(APRELEASE)
| $(APRELEASE) update-all
#+END_SRC

* Notes

** Conf file format
#+BEGIN_EXAMPLE
NAME="App Name"
FORGE="github"           # github | gitlab | codeberg | forgejo | direct | dead
REPO="owner/repo"        # for github/gitlab/codeberg/forgejo
TYPE="appimage"          # only appimage for now
APPIMG_NAME="AppName"    # prefix used for version detection in ~/Applications
ASSET_RE='AppName-.*\.AppImage$'  # regex to match the asset name

# Optional:
FORGE_BASE_URL="https://git.selfhosted.example"  # for forgejo
FORGE_TOKEN="ghp_xxx"   # for higher rate limits or private repos
DIRECT_URL="https://..."  # for FORGE=direct
DIRECT_VERSION_CMD="..."  # for FORGE=direct
#+END_EXAMPLE

** Forgejo / Gitea self-hosted
Set FORGE=forgejo and FORGE_BASE_URL pointing to your Forgejo/Gitea instance.
The API endpoint used is: ${FORGE_BASE_URL}/api/v1/repos/${REPO}/releases?limit=1

** Rate limit strategy
- GitHub: 60 req/hour unauthenticated. apprelease stores ETag in =~/.cache/apprelease/<app>/etag=
  and sends If-None-Match header. On 304 Not Modified, no count against limit.
- GitLab: 500 req/min — generous, ETag caching also used.
- Codeberg: depends on instance settings, generally permissive.
- Use GH_TOKEN in conf file to lift GitHub limit to 5000 req/hour.

** Emulator succession (post-DMCA)
- yuzu (Nintendo, Feb 2024) → Eden (Forgejo: git.eden-emu.dev/eden-emu/eden) — DMCA'd GitHub Mar 2026
- yuzu forks (Suyu, Sudachi, etc.) → all DMCA'd
- citra (2024) → Azahar (github.com/azahar-emu/azahar) + AzaharPlus
- Lime3DS → archived, absorbed into Azahar
- Ryujinx → mirror at github.com/enbyte/ryujinx-mirror-cubed (unstable)
- Citron → git.citron-emu.org (intermittent 522)