all/.local/bin/appimage-ail-scrub
#!/usr/bin/env bash
# Stop & scrub AppImageLauncher artifacts (user + system)

# [[file:../../../appimage.org::*Stop & scrub AppImageLauncher artifacts (user + system)][Stop & scrub AppImageLauncher artifacts (user + system):1]]
set -Eeuo pipefail
echo "== AIL scrub (user + system) =="

if [[ -d /run/systemd/system ]]; then
    systemctl --user disable --now appimagelauncherd.service 2>/dev/null || true
    systemctl --global disable appimagelauncherd.service 2>/dev/null || true
    sudo systemctl --global disable appimagelauncherd.service 2>/dev/null || true
fi

rm -f ~/.config/systemd/user/appimagelauncherd.service 2>/dev/null || true
sudo rm -f /etc/systemd/user/appimagelauncherd.service /usr/lib/systemd/user/appimagelauncherd.service 2>/dev/null || true
sudo rm -f /etc/systemd/user/default.target.wants/appimagelauncherd.service /usr/lib/systemd/user/default.target.wants/appimagelauncherd.service 2>/dev/null || true

sed -i '/application\/x-appimage/d' ~/.config/mimeapps.list 2>/dev/null || true
sed -i '/application\/x-appimage/d' ~/.local/share/applications/mimeapps.list 2>/dev/null || true
sudo update-desktop-database /usr/share/applications 2>/dev/null || true
sudo update-mime-database /usr/share/mime 2>/dev/null || true

sudo rm -f /etc/apt/sources.list.d/appimagelauncher-team-*.list /etc/apt/trusted.gpg.d/appimagelauncher-team-*.gpg* 2>/dev/null || true

if [[ -d /run/systemd/system ]]; then
    systemctl --user daemon-reload 2>/dev/null || true
    systemctl --user daemon-reexec 2>/dev/null || true
fi

echo "== done =="
# Stop & scrub AppImageLauncher artifacts (user + system):1 ends here
